import streamlit as st
import pandas as pd

st.title('12球団の本拠地')


locations = [
    (42.99183084552767, 141.54903802025277),  # 日本ハム
    (38.25773772227025, 140.90271008488224),  # 楽天イーグルス
    (35.64626416312794, 140.03068838079696),  # 千葉ロッテマリーンズ
    (35.76921568116529, 139.42027636555983),  # 西武ライオンズ
    (35.67459436085257, 139.71705392666257),  # 東京ヤクルトスワローズ
    (35.70718126562424, 139.75161154823292),  # 読売ジャイアンツ
    (35.443368369926056, 139.6400856518472),  # 横浜ベイスターズ
    (35.190000475567096, 136.94863904730278),  # 中日ドラゴンズ
    (34.66943469781582, 135.47605890290856),  # オリックスバファローズ
    (34.72135545251173, 135.36169432747968),  # 阪神タイガース
    (34.3920880038851, 132.48407495453117),  # 広島東洋カープ
    (33.59548798789676, 130.36211316151233),  # ソフトバンクホークス
    
]

df = pd.DataFrame(locations, columns=['lat', 'lon'])

data_central = pd.DataFrame({
    'チーム名':["読売ジャイアンツ","阪神タイガース","中日ドラゴンズ","横浜DeNAベイスターズ","広島東洋カープ","東京ヤクルトスワローズ"],
    "正式球場名":["東京ドーム","阪神甲子園球場","ナゴヤドーム","横浜スタジアム","広島市民球場","明治神宮野球場"],
    "所在地":["東京都文京区後楽1-3-61","兵庫県西宮市甲子園町1-82","愛知県名古屋市東区大幸南1-1-1","神奈川県横浜市中区横浜公園","広島県広島市南区南蟹屋2-3-1","東京都新宿区霞ヶ丘町3-1"],
    "会場年月":["1988年3月","1924年8月","1997年3月","1978年3月","2009年3月","1926年10月"]
})

data_pacific = pd.DataFrame({
    'チーム名':["福岡ソフトバンクホークス","千葉ロッテマリーンズ","埼玉西武ライオンズ","東北楽天ゴールデンイーグルス","北海道日本ハムファイターズ","オリックス・バファローズ"],
    "正式球場名":["福岡ドーム","千葉マリンスタジアム","	西武ドーム","宮城球場","エスコンフィールドＨＯＫＫＡＩＤＯ","大阪ドーム"],
    "所在地":["福岡県福岡市中央区地行浜2-2-2","千葉県千葉市美浜区美浜1","埼玉県所沢市上山口2135","宮城県仙台市宮城野区宮城野2-11-6","北海道北広島市Fビレッジ1番地","大阪府大阪市西区千代崎3-中2-1"],
    "会場年月":["1993年4月","1990年2月","1979年4月","1950年5月","2023年3月","1997年3月"]
})




st.map(df)
st.dataframe(data_central,hide_index=True,)
st.dataframe(data_pacific,hide_index=True,)

